import numpy as np

x1 = np.array([1,2,3])  # (3,)
print("x1 = ", x1.shape) # 데이터 구조를 먼저 파악, 실행결과는 (3,)
# 위 실행결과를 보고 벡터인지, 행렬인지 등을 파악 가능
# input_dim=1 -> 차원이 1개라는 뜻, dim=디멘션

# 쉐이프 구하기
x2 = np.array([[1,2,3]])  
print("x2 = ", x2.shape)    # (1,3)

x3 = np.array([[1,2], [3,4]])   
print("x3 = ", x3.shape)    # (2,2)

x4 = np.array([[1,2], [3,4], [5,6]])    
print("x4 = ", x4.shape)    # (3,2)

# x5 = np.array([[[1,2], [3,4], [5,6,7]]])  # 오류, 쉐이프가 맞지 않음
x5 = np.array([[[1,2], [3,4], [5,6,]]])  # 이상 없음, 뒤에 콤마 붙는거 파이썬 기초에서 상관없음
print("x5 = ", x5.shape) # (1,3,2)

x6 = np.array([[[1,2], [3,4]], [[5,6], [7,8]]]) 
print("x6 = ", x6.shape)    # (2,2,2)

x7 = np.array([[[[[1,2,3,4,5],[6,7,8,9,10]]]]]) 
print("x7 = ", x7.shape)    # (1,1,1,2,5)
#실무에선 실제로 쉐이프를 일일히 세지 않고, .shape 사용해서 쉐이프 구조 파악 후 진행함

x8 = np.array([[[1,2,3]], [[4,5,6]]])
print("x8 = ", x8.shape)    # (2,1,3)

x9 = np.array([[[[1]]], [[[2]]]])
print("x9 = ", x9.shape)    # (2,1,1,1)
