from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense
import numpy as np



#2. 모델
model = Sequential()
model.add(Dense(3, input_dim = 1)) # 파라미터 = 6
model.add(Dense(4)) # 파라미터 = 16
model.add(Dense(3)) # 파라미터 = 15
model.add(Dense(1)) # 파라미터 = 4

model.summary()
"""
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━┓
┃ Layer (type)                         ┃ Output Shape                ┃         Param # ┃
┡━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━┩
│ dense (Dense)                        │ (None, 3)                   │               6 │
├──────────────────────────────────────┼─────────────────────────────┼─────────────────┤
│ dense_1 (Dense)                      │ (None, 4)                   │              16 │
├──────────────────────────────────────┼─────────────────────────────┼─────────────────┤
│ dense_2 (Dense)                      │ (None, 3)                   │              15 │
├──────────────────────────────────────┼─────────────────────────────┼─────────────────┤
│ dense_3 (Dense)                      │ (None, 1)                   │               4 │
└──────────────────────────────────────┴─────────────────────────────┴─────────────────┘
Total params: 41 (164.00 B)
Trainable params: 41 (164.00 B)

왜 파라미터 개수가 내 생각과 다르게 나올까?
첫 Dense 의 경우 1*3 이니까 파라미터는 3이 나와야하지 않을까?
파라미터 = 학습으로 바뀌는 개별 숫자 하나
 - w (가중치)  학습으로 바뀜 → 파라미터 1개
 - b (편향)  학습으로 바뀜 → 파라미터 1개
 - x는?  입력 데이터라 고정. 학습으로 안 바뀜 → 파라미터 아님
y = wx + b
summary 에서는 bias 값을 포함하여 계산함

통상적으로 y = wx + b 라고 하는데 이게 맞을까?
실질적으로는 저렇게 계산하면 틀림
원래는 y = xw+b 가 맞음. 왜? (행렬 예시로 들었는데 잘모르겠음)

"""
